;;;;;;;;;;;;;;;
;; ABILITIES ;;
;;;;;;;;;;;;;;;

;CHEMIST

[LWD_Gasser X2AbilityTemplate]
LocFriendlyName="Gasser"
LocFlyOverText="Gasser"
LocHelpText="You always carry an extra gas grenade into battle."
LocLongDescription="You always carry an extra gas grenade into battle."
LocPromotionPopupText="<Bullet/>Uses more powerful options if they're available.<br/>"

[LWD_HeightenedImmuneSystem X2AbilityTemplate]
LocFriendlyName="Heightened Immune System"
LocFlyOverText="Heightened Immune System"
LocHelpText="You are immune to poison, and recover from injuries more quickly than usual."
LocLongDescription="You are immune to poison, and recover from injuries more quickly than usual."
LocPromotionPopupText="<Bullet/>You resist both standard poison and Chryssalid poison.<br/><Bullet/>You recover from injuries after battle as if you'd taken one less point of damage.<br/>"

[LWD_Cloudkill X2AbilityTemplate]
LocFriendlyName="Cloudkill"
LocFlyOverText="Cloudkill"
LocHelpText="Your gas grenades have a significantly increased area."
LocLongDescription="Your gas grenades have a significantly increased area."
LocPromotionPopupText="<Bullet/>Cloudkill allows you to blanket entire swaths of the battlefield in gas, making for effective area denial.<br/>"

[LWD_Pyromancer X2AbilityTemplate]
LocFriendlyName="Pyromancer"
LocFlyOverText="Pyromancer"
LocHelpText="You are immune to fire damage, and your incendiary grenades ignore armor."
LocLongDescription="You are immune to fire damage, and your incendiary grenades ignore armor."
LocPromotionPopupText="<Bullet/>The fire immunity applies to more than just flames started by incendiary grenades; you can also ignore environmental flames.<br/>"

[LWD_ThirdDegree X2AbilityTemplate]
LocFriendlyName="Third Degree"
LocFlyOverText="Third Degree"
LocHelpText="Your incendiary grenades deal increased damage over time."
LocLongDescription="Your incendiary grenades deal increased damage over time."
LocPromotionPopupText="<Bullet/>The damage over time caused by your incendiary grenades more than doubles, making them deadly against high-health units.<br/>"

[LWD_CausticPersonality X2AbilityTemplate]
LocFriendlyName="Caustic Personality"
LocFlyOverText="Caustic Personality"
LocHelpText="You always carry an extra acid grenade into battle."
LocLongDescription="You always carry an extra acid grenade into battle."
LocPromotionPopupText="<Bullet/>You always carry an extra acid grenade into battle.<br/><Bullet/>Uses more powerful options if they're available.<br/>"

[LWD_AcidBurns X2AbilityTemplate]
LocFriendlyName="Acid Burns"
LocFlyOverText="Acid Burns"
LocHelpText="Your acid grenades deal significantly more damage to unarmored enemies."
LocLongDescription="Your acid grenades deal significantly more damage to unarmored enemies."
LocPromotionPopupText="<Bullet/>The extra damage applies if your acid grenades shred an enemy's armor, making them more effective even against low-armor enemies.<br/>"

[LWD_AlkalineArmor X2AbilityTemplate]
LocFriendlyName="Alkaline Armor"
LocFlyOverText="Alkaline Armor"
LocHelpText="You are immune to acid damage, and you deal acid damage to melee attackers."
LocLongDescription="You are immune to acid damage, and you deal significant acid damage to melee attackers."
LocPromotionPopupText="<Bullet/>The damage to melee attackers only triggers if you survive the attack.<br/>"

[LWD_Frostlord X2AbilityTemplate]
LocFriendlyName="Frostlord"
LocFlyOverText="Frostlord"
LocHelpText="You always carry an extra frost bomb into battle. The area of your frost bombs is increased."
LocLongDescription="You always carry an extra frost bomb into battle. The area of your frost bombs is increased."
LocPromotionPopupText="<Bullet/>You always carry an extra frost bomb into battle. The area of your frost bombs is increased.<br/>"

[LWD_MadChemist X2AbilityTemplate]
LocFriendlyName="Mad Chemist"
LocFlyOverText="Mad Chemist"
LocHelpText="The initial explosions of your grenades deal half damage, but you carry an extra gas, incendiary, and acid grenade into battle."
LocLongDescription="The initial explosions of your grenades deal half damage, but you carry an extra gas, incendiary, and acid grenade into battle."
LocPromotionPopupText="<Bullet/>Your grenades become less useful for their explosions, but the sheer volume of grenades you carry allows you to take full advantage of their secondary effects.<br/>"

;COWBOY

[LWD_CoachGun X2AbilityTemplate]
LocFriendlyName="Coach Gun"
LocFlyOverText="Coach Gun"
LocHelpText="Fire your sawed-off shotgun in a small cone"
LocLongDescription="Fire your sawed-off shotgun in a small cone"
LocPromotionPopupText="<Bullet/>Attacks all enemies in a small cone.<br/><Bullet/>The sawed-off shotgun's significant range penalties still apply.<br/>"

[LWD_Shootist X2AbilityTemplate]
LocFriendlyName="Shootist"
LocFlyOverText="Shootist"
LocHelpText="You gain a +10 bonus to aim and critical chance with pistols."
LocLongDescription="You gain a +10 bonus to aim and critical chance with pistols."
LocPromotionPopupText="<Bullet/>You gain a +10 bonus to aim and critical chance with pistols.<br/>"

[LWD_LeadDealer X2AbilityTemplate]
LocFriendlyName="Lead Dealer"
LocFlyOverText="Lead Dealer"
LocHelpText="Your pistol shots never graze."
LocLongDescription="Your pistol shots never graze."
LocPromotionPopupText="<Bullet/>Whenever a pistol shot would graze, it is instead turned into a hit.<br/>"

[LWD_StoppingPower X2AbilityTemplate]
LocFriendlyName="Stopping Power"
LocFlyOverText="Stopping Power"
LocHelpText="Your coach gun disorients enemies it damages."
LocLongDescription="Your coach gun disorients enemies it damages."
LocPromotionPopupText="<Bullet/>Your coach gun becomes even more effective for disrupting clumped enemies, and reduces the danger of hitting an enemy without killing them.<br/>"

[LWD_TrickShot X2AbilityTemplate]
LocFriendlyName="Trick Shot"
LocFlyOverText="Trick Shot"
LocHelpText="Critical hits with your pistol disable the target's weapon."
LocLongDescription="Critical hits with your pistol disable the target's weapon."
LocPromotionPopupText="<Bullet/>Critical hits force your enemy to reload before they can fire again.<br/>"

[LWD_Dreadful X2AbilityTemplate]
LocFriendlyName="Dreadful"
LocFlyOverText="Dreadful"
LocHelpText="Killing an enemy with your pistol grants a bonus action."
LocLongDescription="Killing an enemy with your pistol grants a bonus action."
LocPromotionPopupText="<Bullet/>The bonus action can only be granted once per turn.<br/><Bullet/>In combination with other pistol abilities like Lightning Hands or Liquidator, this ability can leave you with more actions than you started with."

[LWD_QuickHands X2AbilityTemplate]
LocFriendlyName="Quick Hands"
LocFlyOverText="Quick Hands"
LocHelpText="Firing your sawed-off shotgun doesn't end your turn, and the first reload you make in a turn doesn't cost an action."
LocLongDescription="Firing your sawed-off shotgun doesn't end your turn, and the first reload you make in a turn doesn't cost an action."
LocPromotionPopupText="<Bullet/>If you have Spare Shells, that ability can trigger the action refund.<br/>"

[LWD_BattleMomentum X2AbilityTemplate]
LocFriendlyName="Battle Momentum"
LocFlyOverText="Battle Momentum"
LocHelpText="Every hit you get with your pistol increases your crit chance by 10%."
LocLongDescription="Every hit you get with your pistol increases your crit chance by 10%."
LocPromotionPopupText="<Bullet/>The bonus is cumulative, but resets upon getting a critical hit.<br/>"

[LWD_SpareShells X2AbilityTemplate]
LocFriendlyName="Spare Shells"
LocFlyOverText="Spare Shells"
LocHelpText="Reload your sawed-off shotgun. Each action reloads one shell."
LocLongDescription="Reload your sawed-off shotgun. Each action reloads one shell."
LocPromotionPopupText="<Bullet/>Spare Shells doesn't reload the entire clip, but enables you to rely on your Coach Gun throughout the fight.<br/>"

[LWD_HighNoon X2AbilityTemplate]
LocFriendlyName="High Noon"
LocFlyOverText="High Noon"
LocHelpText="Mark an enemy; no range penalties against them, but double range penalties against all other targets."
LocLongDescription="Mark an enemy; no range penalties against them, but double range penalties against all other targets."
LocPromotionPopupText="<Bullet/>High Noon allows you to ensure a single target is always within your reach, but restrains you from taking anything but good shots against other targets.<br/><Bullet/>Lasts until the end of your next turn.<br/>"

[LWD_SixShooter X2AbilityTemplate]
LocFriendlyName="Six-Shooter"
LocFlyOverText="Six-Shooter"
LocHelpText="Fire six shots with your pistol. Costs two actions."
LocLongDescription="Fire six shots with your pistol. Costs two actions."
LocPromotionPopupText="<Bullet/>A powerful attack that can focus down a single tough enemy, or clean up a squad of weaker ones.<br/><Bullet/>1 use per mission.<br/><Bullet/>Each shot can target the same or a different target, divided as you choose.<br/>"

[LWD_TrueGrit X2AbilityTemplate]
LocFriendlyName="True Grit"
LocFlyOverText="True Grit"
LocHelpText="Whenever you take damge, gain 2 armor until the start of your next turn."
LocLongDescription="Whenever you take damge, gain 2 armor until the start of your next turn."
LocPromotionPopupText="<Bullet/>Can be triggered more than once.<br/><Bullet/>Stacks with itself.<br/>"

[LWD_HangEmHigh X2AbilityTemplate]
LocFriendlyName="Hang 'Em High"
LocFlyOverText="Hang 'Em High"
LocHelpText="Your pistol deals +1 damage, your <Ability:WeaponName/> deals +2 damage, and your sawed-off shotgun deals +3 damage."
LocLongDescription="Your pistol deals +1 damage, your <Ability:WeaponName/> deals +2 damage, and your sawed-off shotgun deals +3 damage."
LocPromotionPopupText="<Bullet/>All of your weapons deal bonus damage, letting you use the right tool for whatever situation you find yourself in.<br/>"

[LWD_Unforgiven X2AbilityTemplate]
LocFriendlyName="Unforgiven"
LocFlyOverText="Unforgiven"
LocHelpText="Your sawed-off shotgun has a massive bonus to Aim when concealed or flanking."
LocLongDescription="Your sawed-off shotgun has a massive bonus to Aim when concealed or flanking."
LocPromotionPopupText="<Bullet/>Allows you to target enemies even out to the limits of your sawed-off's range.<br/><Bullet/>A powerful tool for engaging from stealth.<br/>"

[LWD_HadItComing X2AbilityTemplate]
LocFriendlyName="Had It Coming"
LocFlyOverText="Had It Coming"
LocHelpText="Your sawed-off shotgun has a massive bonus to critical chance when flanking."
LocLongDescription="Your sawed-off shotgun has a massive bonus to critical chance when flanking."
LocPromotionPopupText="<Bullet/>An upgraded hit is almost guaranteed.<br/><Bullet/>Especially powerful when combined with Unforgiven.<br/>"


;FIELD SCIENTIST

[LWD_Hotwire X2AbilityTemplate]
LocFriendlyName="Hotwire"
LocFlyOverText="Hotwire"
LocHelpText="Disrupt an enemy mechanical unit with your <Ability:SecondaryWeaponName/>. Uses Hack to determine accuracy."
LocLongDescription="Disrupt an enemy mechanical unit with your <Ability:SecondaryWeaponName/>. Uses Hack to determine accuracy."
LocPromotionPopupText="<Bullet/>Use Hack vs. the target's Hack Defense to determine accuracy.<br/><Bullet/>Outcomes range from disorientation to shutdown to even full hacks.<br/>"
LocMissText="Hotwire failed!"

[LWD_ShortCircuit X2AbilityTemplate]
LocFriendlyName="Short Circuit"
LocFlyOverText="Short Circuit"
LocHelpText="Hotwire ruptures its target."
LocLongDescription="Hotwire ruptures its target."
LocPromotionPopupText="<Bullet/>Also causes Hotwire to deal some damage.<br/>"

[LWD_GreasedLightning X2AbilityTemplate]
LocFriendlyName="Greased Lightning"
LocFlyOverText="Greased Lightning"
LocHelpText="Using your <Ability:SecondaryWeaponName/> no longer ends your turn."
LocLongDescription="Using your <Ability:SecondaryWeaponName/> no longer ends your turn."
LocPromotionPopupText="<Bullet/>Affects Stun, Arc Pulser, and Hotwire.<br/>"

[LWD_ScriptKiddie X2AbilityTemplate]
LocFriendlyName="Script Kiddie"
LocFlyOverText="Script Kiddie"
LocHelpText="You always carry an extra EMP grenade into battle. The area of your EMP grenades is increased."
LocLongDescription="You always carry an extra EMP grenade into battle. The area of your EMP grenades is increased."
LocPromotionPopupText="<Bullet/>Uses more powerful options if they're available.<br/>"

[LWD_Skullminer X2AbilityTemplate]
LocFriendlyName="Skullminer"
LocFlyOverText="Skullminer"
LocHelpText="You gain two extra charges of skullmining when equipped with a skulljack."
LocLongDescription="You gain two extra charges of skullmining when equipped with a skulljack."
LocPromotionPopupText="<Bullet/>Requires a skulljack with the Skullmining ability researched.<br/>"

[LWD_Clear X2AbilityTemplate]
LocFriendlyName="Clear!"
LocFlyOverText="Clear!"
LocHelpText="Stabilize a bleeding out ally with your <Ability:SecondaryWeaponName/>."
LocLongDescription="Stabilize a bleeding out ally with your <Ability:SecondaryWeaponName/>."
LocPromotionPopupText="<Bullet/>Allows you to stabilize allies from a distance.<br/>"

[LWD_Juiced X2AbilityTemplate]
LocFriendlyName="Juiced"
LocFlyOverText="Juiced"
LocHelpText="Use your <Ability:SecondaryWeaponName/> to grant an ally a bonus move action. 2-turn cooldown."
LocLongDescription="Use your <Ability:SecondaryWeaponName/> to grant an ally a bonus move action. 2-turn cooldown."
LocPromotionPopupText="<Bullet/>Can target any ally within range.<br/>"


;RAIDER

[LWD_Onslaught X2AbilityTemplate]
LocFriendlyName="Onslaught"
LocFlyOverText="Onslaught"
LocHelpText="Fire your <Ability:WeaponName/>. If charged, a hit grants a bonus move."
LocLongDescription="Fire your <Ability:WeaponName/>. If charged, a hit grants a bonus move."
LocPromotionPopupText="<Bullet/>If Onslaught is charged, hitting grants you a bonus movement-only action.<br/><Bullet/>A hit charges Reave.<br/><Bullet/>Charged Onslaught enables risky positioning for flanks by allowing you to move to safety afterwards.<br/>"

[LWD_Reave X2AbilityTemplate]
LocFriendlyName="Reave"
LocFlyOverText="Reave"
LocHelpText="Attack with your <Ability:SecondaryWeaponName/>. If charged, deals +2 damage."
LocLongDescription="Attack with your <Ability:SecondaryWeaponName/>. If charged, deals +2 damage."
LocPromotionPopupText="<Bullet/>Onslaught and Reave work together; a hit with one charges the other.<br/><Bullet/>If Onslaught is charged, hitting grants you a bonus movement-only action, enabling risky maneuvering for flanks or shot-on-the-run tactics.<br/><Bullet/>If Reave is charged, it deals +2 damage, taking down many opponents in a single attack.<br/><Bullet/>Misses consume charges, but only hits grant them.<br/><Bullet/>Rotate between Onslaught and Reave for maximum damage and maneuverability.<br/>"

[LWD_BattleFocus X2AbilityTemplate]
LocFriendlyName="Battle Focus"
LocFlyOverText="Battle Focus"
LocHelpText="Onslaught no longer ends your turn. Charged Onslaught deals bonus damage on a crit."
LocLongDescription="Onslaught no longer ends your turn. Charged Onslaught deals bonus damage on a crit."
LocPromotionPopupText="<Bullet/>Allows you to use Onslaught to charge Reave, and then immediately take advantage of Reave's charge.<br/>"

[LWD_BattleFury X2AbilityTemplate]
LocFriendlyName="Battle Fury"
LocFlyOverText="Battle Fury"
LocHelpText="Reave no longer ends your turn. Charged Reave shreds armor."
LocLongDescription="Reave no longer ends your turn. Charged Reave shreds armor."
LocPromotionPopupText="<Bullet/>The amount of shredding increases with more advanced weaponry.<br/><Bullet/>Allows you to use Reave to charge Onslaught, then immediately take advantage of Onslaught's charge.<br/><Bullet/>Combined with charged Onslaught's bonus move, enables vicious hit-and-run attacks.<br/>"

[LWD_CombatStance X2AbilityTemplate]
LocFriendlyName="Combat Stance"
LocFlyOverText="Combat Stance"
LocHelpText="If Onslaught is charged, reaction fire is more accurate. If Reave is charged, you can counterattack melee attacks."
LocLongDescription="If Onslaught is charged, reaction fire is more accurate. If Reave is charged, you can counterattack melee attacks."
LocPromotionPopupText="<Bullet/>Careful management of charges allows you to control your defenses for the current situation.<br/>"

[LWD_Ravager X2AbilityTemplate]
LocFriendlyName="Ravager"
LocFlyOverText="Ravager"
LocHelpText="A critical hit with charged Onslaught doesn't cost an action."
LocLongDescription="A critical hit with charged Onslaught doesn't cost an action."
LocPromotionPopupText="<Bullet/>Can only trigger once per turn.<br/>"

[LWD_Reaver X2AbilityTemplate]
LocFriendlyName="Reaver"
LocFlyOverText="Reaver"
LocHelpText="Charged Reave has a bonus to Aim and critical chance based on how wounded the target is."
LocLongDescription="Charged Reave has a bonus to Aim and critical chance based on how wounded the target is."
LocPromotionPopupText="<Bullet/>The bonus scales up to +50 Aim and critical chance when the target has 10% of their HP remaining.<br/>"

[LWD_Berserker X2AbilityTemplate]
LocFriendlyName="Berserker"
LocFlyOverText="Berserker"
LocHelpText="Takind damage charges Onslaught and Reave."
LocLongDescription="Takind damage charges Onslaught and Reave."
LocPromotionPopupText="<Bullet/>Taking damage charges Onslaught and Reave.<br/>"

[LWD_Warlord X2AbilityTemplate]
LocFriendlyName="Warlord"
LocFlyOverText="Warlord"
LocHelpText="Onslaught and Reave can both hold an extra charge. Misses don't consume charges."
LocLongDescription="Onslaught and Reave can both hold an extra charge. Misses don't consume charges."
LocPromotionPopupText="<Bullet/>Having more than one charge doesn't increase their effects, but it does allow you to gain the charged benefits twice in a row.<br/>"

[LWD_Viking X2AbilityTemplate]
LocFriendlyName="Viking"
LocFlyOverText="Viking"
LocHelpText="Charged Onslaught has +10 Aim. Charged Reave has +2 damage."
LocLongDescription="Charged Onslaught has +10 Aim. Charged Reave has +2 damage."
LocPromotionPopupText="<Bullet/>Significantly increases the benefits of charged Onslaught and Reave.<br/>"


;RECON

[LWD_Watchman X2AbilityTemplate]
LocFriendlyName="Watchman"
LocFlyOverText="Watchman"
LocHelpText="Entering overwatch increases your vision range significantly."
LocLongDescription="Entering overwatch increases your vision range significantly."
LocPromotionPopupText="<Bullet/>Your attacks are still limited by your weapon's range, as normal.<br/>"

[LWD_Lookout X2AbilityTemplate]
LocFriendlyName="Lookout"
LocFlyOverText="Lookout"
LocHelpText="Marking an enemy with your holotargeter increases your allies' defense against them until the start of your next turn."
LocLongDescription="Marking an enemy with your holotargeter increases your allies' defense against them until the start of your next turn."
LocPromotionPopupText="<Bullet/>Unaffected by Independent Tracking or other duration increases to Holotarget.<br/>"

[LWD_ScannerSweep X2AbilityTemplate]
LocFriendlyName="Scanner Sweep"
LocFlyOverText="Scanner Sweep"
LocHelpText="Scan for enemies in a large cone."
LocLongDescription="Scan for enemies in a large cone."
LocPromotionPopupText="<Bullet/>Reveals enemies outside your sight range, and can detect Faceless and burrowed Chryssalids.<br/>"

[LWD_EagleEyes X2AbilityTemplate]
LocFriendlyName="Eagle Eyes"
LocFlyOverText="Eagle Eyes"
LocHelpText="Your vision radius increases by 3 tiles, and you gain +5% critical chance."
LocLongDescription="Your vision radius increases by 3 tiles, and you gain +5% critical chance."
LocPromotionPopupText="<Bullet/>Your vision radius increases by 3 tiles, and you gain +5% critical chance.<br/>"

[LWD_Lightfoot X2AbilityTemplate]
LocFriendlyName="Lightfoot"
LocFlyOverText="Lightfoot"
LocHelpText="Your mobility is reduced, but you gain an additional action point each round."
LocLongDescription="Your mobility is reduced, but you gain an additional action point each round."
LocPromotionPopupText="<Bullet/>Enables more precise scouting and maneuvering.<br/><Bullet/>Many actions will still end your turn, regardless of how many action points you have left.<br/>"

[LWD_GhostPassive X2AbilityTemplate]
LocFriendlyName="Ghost"
LocFlyOverText="Ghost"
LocHelpText="Your detection radius is reduced by 25%. Activate to increase the reduction to 75% until the start of your next turn."
LocLongDescription="Your detection radius is reduced by 25%. Activate to increase the reduction to 75% until the start of your next turn."
LocPromotionPopupText="<Bullet/>Ghost makes it far safer and easier to scout in concealment.<br/><Bullet/>Partnered with detection reducing equipment such as SMGs, activating Ghost can reduce your detection radius to practically nothing.<br/>"

[LWD_GhostActive X2AbilityTemplate]
LocFriendlyName="Ghost"
LocFlyOverText="Ghost"
LocHelpText="Increase Ghost's detection radius reduction from 25% to 75% until the start of your next turn."
LocLongDescription="Increase Ghost's detection radius reduction from 25% to 75% until the start of your next turn."
LocPromotionPopupText="<Bullet/>Increase Ghost's detection radius reduction from 25% to 75% until the start of your next turn.<br/>"


;OTHERs

[LWD_AntiMateriel X2AbilityTemplate]
LocFriendlyName="Anti-Materiel Rounds"
LocFlyOverText="Anti-Materiel Rounds"
LocHelpText="Your <Ability:WeaponName/> attacks pierce armor. Higher tier weapons pierce more armor and shred."
LocLongDescription="Your <Ability:WeaponName/> attacks pierce armor. Higher tier weapons pierce more armor and shred."
LocPromotionPopupText="<Bullet/>The specific amount of piercing and shredding depends on the tier of weaponry used.<br/>"

[LWD_Gallop X2AbilityTemplate]
LocFriendlyName="Gallop"
LocFlyOverText="Gallop"
LocHelpText="Activate at the start of your turn; you gain an extra action, but all of your actions can only be spent on moves."
LocLongDescription="Activate at the start of your turn; you gain an extra action, but all of your actions can only be spent on moves."
LocPromotionPopupText="<Bullet/>Gallop allows you to linger in good sniping position, knowing you can catch up to the rest of the squad as soon as you need to.<br/>"

[LWD_FullyStocked X2AbilityTemplate]
LocFriendlyName="Fully Stocked"
LocFlyOverText="Fully Stocked"
LocHelpText="You carry an additional rocket into battle."
LocLongDescription="You carry an additional rocket into battle."
LocPromotionPopupText="<Bullet/>You carry an additional rocket into battle.<br/>"

[LWD_HandsandFeet X2AbilityTemplate]
LocFriendlyName="Hands and Feet"
LocFlyOverText="Hands and Feet"
LocHelpText="Whenever you spend all your actions on movement, reload your weapon for free."
LocLongDescription="Whenever you spend all your actions on movement, reload your weapon for free."
LocPromotionPopupText="<Bullet/>Allows you to stay on the move and ready for action.<br/>"

[LWD_ArtificialIntelligence X2AbilityTemplate]
LocFriendlyName="Artificial Intelligence"
LocFlyOverText="Artificial Intelligence"
LocHelpText="Activate to cause your next GREMLIN ability to not cost an action."
LocLongDescription="Activate to cause your next GREMLIN ability to not cost an action."
LocPromotionPopupText="<Bullet/>Artificial Intelligence allows you to use your GREMLIN while on the move, or to attack with your weapon while still using several abilities.<br/><Bullet/>Can also apply to hacks made with your GREMLIN.<br/>"

[LWD_SelfAware X2AbilityTemplate]
LocFriendlyName="Optimized Code"
LocFlyOverText="Optimized Code"
LocHelpText="Activate to immediately reset all GREMLIN ability cooldowns."
LocLongDescription="Activate to immediately reset all GREMLIN ability cooldowns."
LocPromotionPopupText="<Bullet/>Has a massive cooldown.<br/>"

[LWD_SmartlinkProtocol X2AbilityTemplate]
LocFriendlyName="Smartlink Protocol"
LocFlyOverText="Smartlink Protocol"
LocHelpText="Send your GREMLIN to an ally to grant them a bonus to Aim for a turn."
LocLongDescription="Send your GREMLIN to an ally to grant them a bonus to Aim for a turn."
LocPromotionPopupText="<Bullet/>Smartlink Protocol, if used with your first action, will not end your turn.<br/><Bullet/>More advanced GREMLIN models will increase the bonus granted.<br/>"

[LWD_Jab X2AbilityTemplate]
LocFriendlyName="Jab"
LocFlyOverText="Jab"
LocHelpText="Move a short distance and attack with your <Ability:SecondaryWeaponName/>."
LocLongDescription="Move a short distance and attack with your <Ability:SecondaryWeaponName/>."
LocPromotionPopupText="<Bullet/>Movement distance is approximately half of a blue move.<br/>"

[LWD_WhereItHurts X2AbilityTemplate]
LocFriendlyName="Where It Hurts"
LocFlyOverText="Where It Hurts"
LocHelpText="Jab disorients enemies on a hit."
LocLongDescription="Jab disorients enemies on a hit."
LocPromotionPopupText="<Bullet/>The disorientation applies only to jab, not to any other attacks with your <Ability:SecondaryWeaponName/>.<br/>"

[LWD_TightChoke X2AbilityTemplate]
LocFriendlyName="Tight Choke"
LocFlyOverText="Tight Choke"
LocHelpText="Your sawed-off shotgun's range penalties are reduced."
LocLongDescription="Your sawed-off shotgun's range penalties are reduced."
LocPromotionPopupText="<Bullet/>Tight Choke enables you to make attacks with your sawed-off shotgun without requiring you to be practically adjacent to your target.<br/>"

[LWD_WhitesofTheirEyes X2AbilityTemplate]
LocFriendlyName="Whites of Their Eyes"
LocFlyOverText="Whites of Their Eyes"
LocHelpText="Take a free shot with your sawed-off shotgun when an enemy moves nearby."
LocLongDescription="Take a free shot with your sawed-off shotgun when an enemy moves nearby."
LocPromotionPopupText="<Bullet/>Unlike most reaction fire, this shot can crit.<br/><Bullet/>The shot triggers on movement only, not attacks.<br/>"

[LWD_CattleProd X2AbilityTemplate]
LocFriendlyName="Cattle Prod"
LocFlyOverText="Cattle Prod"
LocHelpText="Disorient an enemy in melee with your <Ability:SecondaryWeaponName/>."
LocLongDescription="Disorient an enemy in melee with your <Ability:SecondaryWeaponName/>."
LocPromotionPopupText="<Bullet/>Allows a blue move before the attack.<br/>"

[LWD_Dynamite X2AbilityTemplate]
LocFriendlyName="Dynamite"
LocFlyOverText="Dynamite"
LocHelpText="You always carry a shaped charge into battle, and the radius of your shaped charges is increased."
LocLongDescription="You always carry a shaped charge into battle, and the radius of your shaped charges is increased."
LocPromotionPopupText="<Bullet/>You always carry a shaped charge into battle, and the radius of your shaped charges is increased.<br/>"


;;;;;;;;;;;;;;;
;;	CLASSES	 ;;
;;;;;;;;;;;;;;;

[LWD_Artillery X2SoldierClassTemplate]
+DisplayName="Artillery"
+ClassSummary="Artillery train with sniper rifles and rocket launchers, and are at their best when their enemy is a mile away."
+LeftAbilityTreeTitle="Tankbuster"
+RightAbilityTreeTitle="Mortar"
; Nicknames
RandomNickNames[0]="Angel"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Beta"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Hometown"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Dr. Feelgood"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Sure Thing"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Gizmo"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Jolt"
RandomNickNames[18]="Lightning"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Mega"
RandomNickNames[21]="Newton"
RandomNickNames[22]="Ragtime"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Skipper"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Zulu"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"

[LWD_Assault X2SoldierClassTemplate]
+DisplayName="Assault"
+ClassSummary="The Assault serves as our primary close range unit, able to push in close and hold the line. They carry an arc thrower to keep the enemy on their toes."
+LeftAbilityTreeTitle="Aggressor"
+RightAbilityTreeTitle="Breacher"
; Nicknames
RandomNickNames[0]="Angel"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Beta"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Shatter"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Dr. Feelgood"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Firewall"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Mad Dog"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Jolt"
RandomNickNames[18]="Lightning"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Mega"
RandomNickNames[21]="Newton"
RandomNickNames[22]="Ragtime"
RandomNickNames[23]="Dancer"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Skipper"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Zulu"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Mr. Go"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Vixen"

[LWD_Chemist X2SoldierClassTemplate]
+DisplayName="Chemist"
+ClassSummary=""
+LeftAbilityTreeTitle=""
+RightAbilityTreeTitle=""
; Nicknames
RandomNickNames[0]="Maniac"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Villain"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Freak"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Dr. Feelgood"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Sure Thing"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Gizmo"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Jolt"
RandomNickNames[18]="Lightning"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Arson"
RandomNickNames[21]="Newton"
RandomNickNames[22]="Laughing Gas"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Skipper"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="The Hurt"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"

[LWD_CombatEngineer X2SoldierClassTemplate]
+DisplayName="Combat Engineer"
+ClassSummary="Some Engineers are more at home on the battlefield than the Avenger. Their technical skills with a GREMLIN come in handy, especially when protecting our soldiers and against enemy mechanical units."
+LeftAbilityTreeTitle="Armorer"
+RightAbilityTreeTitle="Technician"
; Nicknames
RandomNickNames[0]="Chum"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Beta"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Hometown"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Eiger"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Glory"
RandomNickNames[14]="Blitz"
RandomNickNames[15]="Paco"
RandomNickNames[16]="Dante"
RandomNickNames[17]="Decker"
RandomNickNames[18]="Coyote"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Mega"
RandomNickNames[21]="Newton"
RandomNickNames[22]="Ragtime"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Gaichu"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Racter"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Gobbet"
; Male Nicknames
RandomNickNames_Male[0]="Mr. Magoo"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"

[LWD_Courser X2SoldierClassTemplate]
+DisplayName="Courser"
+ClassSummary="The Courser serves best offset from the rest of the squad, specializing in either taking on entire squads, or picking off stragglers. They employ a holotargeter for picking their targets."
+LeftAbilityTreeTitle="Hordebreaker"
+RightAbilityTreeTitle="Duelist"
; Nicknames
RandomNickNames[0]="Angel"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Beta"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Bones"
RandomNickNames[5]="FUBAR"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Dr. Feelgood"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Firewall"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Gizmo"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Jolt"
RandomNickNames[18]="Lightning"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Mega"
RandomNickNames[21]="Newton"
RandomNickNames[22]="Ragtime"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Horseman"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Zulu"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"

[LWD_Cowboy X2SoldierClassTemplate]
+DisplayName="Cowboy"
+ClassSummary="Versatile soldiers that are always ready for anything, Cowboys carry sniper rifles, pistols, and sawed-off shotguns, and are just as deadly with each of them."
+LeftAbilityTreeTitle="Pistoleer"
+RightAbilityTreeTitle="Shotgunner"
; Nicknames
RandomNickNames[0]="Skinny"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Shanghai Kid"
RandomNickNames[3]="The Kid"
RandomNickNames[4]="Hometown"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Snake Oil"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Doc Holliday"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Sundance"
RandomNickNames[13]="Revolver"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Arkansas"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Bandit"
RandomNickNames[18]="Pistolero"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Buffalo"
RandomNickNames[21]="Newton"
RandomNickNames[22]="Ragtime"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattlesnake"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Huckleberry"
RandomNickNames[27]="Tequila"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="Ringo"
RandomNickNames[30]="Eastwood"
RandomNickNames[31]="Unforgiven"
; Male Nicknames
RandomNickNames_Male[0]="The Duke"
RandomNickNames_Male[1]="Black Bart"
RandomNickNames_Male[2]="Padre"
RandomNickNames_Male[3]="Butch"
RandomNickNames_Male[4]="Amigo"
; Female Nicknames
RandomNickNames_Female[0]="Belle"
RandomNickNames_Female[1]="Amiga"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Calamity"
[LWD_Dreadnought X2SoldierClassTemplate]
+DisplayName="Dreadnought"
+ClassSummary="The Dreadnought is a human brick wall, who can take everything the enemy can throw at them and then throw it all back. They employ gauntlets for the really tough enemies."
+LeftAbilityTreeTitle="Immovable"
+RightAbilityTreeTitle="Unstoppable"
; Nicknames
RandomNickNames[0]="Angel"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Beta"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Bones"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Pride"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Boomtown"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Firewall"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Gizmo"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Juggernaut"
RandomNickNames[18]="Stonewall"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Mega"
RandomNickNames[21]="Brick"
RandomNickNames[22]="Ragtime"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Skipper"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Tank"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"

[LWD_FieldScientist X2SoldierClassTemplate]
+DisplayName="Field Scientist"
+ClassSummary="Field Scientists forgo the lab to aid our soldiers directly on the battlefield. They've got some ways to use their arc thrower to keep our soldiers in the fight."
+LeftAbilityTreeTitle="Electrician"
+RightAbilityTreeTitle="Doctor"
; Nicknames
RandomNickNames[0]="Angel"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Beta"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Bones"
RandomNickNames[5]="Moron"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Electrician"
RandomNickNames[10]="Dr. Feelgood"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Firewall"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Gizmo"
RandomNickNames[16]="Professor"
RandomNickNames[17]="Jolt"
RandomNickNames[18]="Lightning"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Mega"
RandomNickNames[21]="Newton"
RandomNickNames[22]="Ragtime"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Skipper"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="Doc"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Segfault"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"

[LWD_Fireman X2SoldierClassTemplate]
+DisplayName="Fireman"
+ClassSummary="Specializing in their gauntlet's flamethrower, Firemen can clear entire rooms of enemies, as well as blocking off chokepoints with walls of flame."
+LeftAbilityTreeTitle="Explosions"
+RightAbilityTreeTitle="Flames"
; Nicknames
RandomNickNames[0]="Angel"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Beta"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Bones"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Lamp"
RandomNickNames[10]="Dr. Feelgood"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Firewall"
RandomNickNames[14]="Boomtown"
RandomNickNames[15]="Flamer"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Jolt"
RandomNickNames[18]="Lightning"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="The Truck"
RandomNickNames[21]="Newton"
RandomNickNames[22]="Ragtime"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Spark"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Torch"
RandomNickNames[31]="Zulu"
; Male Nicknames
RandomNickNames_Male[0]="Waterboy"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"

[LWD_Guerrilla X2SoldierClassTemplate]
+DisplayName="Guerrilla"
+ClassSummary="The Guerrilla is a capable assassin who stays on the move and catches the enemy off-guard. They're comfortable with a variety of firearms, and carry a knife, just in case."
+LeftAbilityTreeTitle="Bushwhacker"
+RightAbilityTreeTitle="Commando"
; Nicknames
RandomNickNames[0]="Grey Ghost"
RandomNickNames[1]="Cavalry"
RandomNickNames[2]="Hiss"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Tootsies"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Mercury"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Firewall"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Gizmo"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Jolt"
RandomNickNames[18]="Lightning"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Mega"
RandomNickNames[21]="Newton"
RandomNickNames[22]="Ragtime"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Skipper"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Zulu"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"

[LWD_Gunner X2SoldierClassTemplate]
+DisplayName="Gunner"
+ClassSummary="The Gunner is trained to use heavy automatic weapons, able to cover the squad with suppressive fire or inflict significant damage in direct attacks. They also carry a combat knife as a backup."
+LeftAbilityTreeTitle="SAW Gunner"
+RightAbilityTreeTitle="Machinegunner"
; Nicknames
RandomNickNames[0]="Angel"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Beta"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Dakka"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Dr. Feelgood"
RandomNickNames[11]="Famine"
RandomNickNames[12]="More"
RandomNickNames[13]="Firewall"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Gizmo"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Tiny"
RandomNickNames[18]="Lightning"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Mega"
RandomNickNames[21]="Newton"
RandomNickNames[22]="Ragtime"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Skipper"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Oak"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Zulu"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"

[LWD_Hacker X2SoldierClassTemplate]
+DisplayName="Hacker"
+ClassSummary="The Hacker is a a savant when it comes to computers. They use their GREMLINs to keep Advent's systems on the fritz."
+LeftAbilityTreeTitle="Operator"
+RightAbilityTreeTitle="Decker"
; Nicknames
RandomNickNames[0]="Angel"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Beta"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Malware"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Professor"
RandomNickNames[10]="Spybot"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Firewall"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Gizmo"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Jolt"
RandomNickNames[18]="Lightning"
RandomNickNames[19]="Worm"
RandomNickNames[20]="Mega"
RandomNickNames[21]="Newton"
RandomNickNames[22]="Botnet"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Skipper"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Virus"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"
[LWD_Hunter X2SoldierClassTemplate]
+DisplayName="Hunter"
+ClassSummary="Our Hunters are a versatile sort, carrying sniper rifles for distant engagements, and swords for when they need to get close. They're good at staying on the move."
+LeftAbilityTreeTitle="Sportsman"
+RightAbilityTreeTitle="Survivalist"
; Nicknames
RandomNickNames[0]="Angel"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Beta"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Bones"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Dr. Feelgood"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Firewall"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Camper"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Jolt"
RandomNickNames[18]="Lightning"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Eyes"
RandomNickNames[21]="Savage"
RandomNickNames[22]="Cleanup"
RandomNickNames[23]="Janitor"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="One-Shot"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Zulu"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"

[LWD_Marksman X2SoldierClassTemplate]
+DisplayName="Marksman"
+ClassSummary="The Marksman is more comfortable with a sniper rifle than most of our soldiers, and carries a sawed-off shotgun for closer ranges."
+LeftAbilityTreeTitle="Rifleman"
+RightAbilityTreeTitle="Shotgunner"
; Nicknames
RandomNickNames[0]="Agent"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Beta"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Bones"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Dr. Feelgood"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Firewall"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Gizmo"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Jolt"
RandomNickNames[18]="Lightning"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Mega"
RandomNickNames[21]="Eyes"
RandomNickNames[22]="Ragtime"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Hitman"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Zulu"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"

[LWD_Medic X2SoldierClassTemplate]
+DisplayName="Medic"
+ClassSummary="The Medic uses their GREMLIN to keep their squad in tip-top fighting shape. "
+LeftAbilityTreeTitle="Healer"
+RightAbilityTreeTitle="Ally"
; Nicknames
RandomNickNames[0]="Angel"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Beta"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Bones"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Doc"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Dr. Feelgood"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Band-Aid"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Gizmo"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Jolt"
RandomNickNames[18]="Lightning"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Mega"
RandomNickNames[21]="Newton"
RandomNickNames[22]="Chance"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Skipper"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Red Cross"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Mr. Fixer"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Nurse Joy"

[LWD_Partisan X2SoldierClassTemplate]
+DisplayName="Partisan"
+ClassSummary="The Partisan makes sure the enemy is never operating at 100%, through their arc thrower, stun grenades, and oppressive fire."
+LeftAbilityTreeTitle="Electrocutioner"
+RightAbilityTreeTitle="Harrasser"
; Nicknames
RandomNickNames[0]="Angel"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Beta"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Pikachu"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Dr. Feelgood"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Firewall"
RandomNickNames[14]="Grey Ghost"
RandomNickNames[15]="Gizmo"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Jolt"
RandomNickNames[18]="Lightning"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Mega"
RandomNickNames[21]="Newton"
RandomNickNames[22]="The Wall"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Skipper"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Zap"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"

[LWD_Protector X2SoldierClassTemplate]
+DisplayName="Protector"
+ClassSummary="The Protector carries a variety of non-lethal and defensive grenades to keep our soldiers safe on the battlefield."
+LeftAbilityTreeTitle="Fire Support"
+RightAbilityTreeTitle="Smokescreen"
; Nicknames
RandomNickNames[0]="Angel"
RandomNickNames[1]="Cover"
RandomNickNames[2]="Beta"
RandomNickNames[3]="Magician"
RandomNickNames[4]="Bones"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Dr. Feelgood"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Firewall"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Illusion"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Jolt"
RandomNickNames[18]="Lightning"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Mega"
RandomNickNames[21]="Newton"
RandomNickNames[22]="Ragtime"
RandomNickNames[23]="Mortar"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Skipper"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Artillery"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Mysterio"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"

[LWD_Raider X2SoldierClassTemplate]
+DisplayName="Raider"
+ClassSummary="The Raider is a vicious foe, keeping inside the enemy's reach with sword and shotgun, making sure they can never sit comfortable."
+LeftAbilityTreeTitle="Skirmisher"
+RightAbilityTreeTitle="Fencer"
; Nicknames
RandomNickNames[0]="Grey Ghost"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Facetime"
RandomNickNames[3]="Elvis"
RandomNickNames[4]="Bones"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Dr. Feelgood"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Firewall"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Gizmo"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Pirate"
RandomNickNames[18]="Cap'n"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Mega"
RandomNickNames[21]="Viking"
RandomNickNames[22]="Ragtime"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Skipper"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Berserk"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"
[LWD_Ranger X2SoldierClassTemplate]
+DisplayName="Ranger"
+ClassSummary="The Ranger is the master of the rifle and may be trained to use it in offensive and defensive capacities. They carry a sawed-off shotgun as a backup as well."
+LeftAbilityTreeTitle="Infantry"
+RightAbilityTreeTitle="Defender"
; Nicknames
RandomNickNames[0]="Angel"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Beta"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Bones"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Dr. Feelgood"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Firewall"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Gizmo"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Jolt"
RandomNickNames[18]="Lightning"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Mega"
RandomNickNames[21]="Newton"
RandomNickNames[22]="Ragtime"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Skipper"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Zulu"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"

[LWD_Recon X2SoldierClassTemplate]
+DisplayName="Recon"
+ClassSummary="The Recon is our eyes and ears on the battlefield, staying out of sight, but always keeping tabs on the enemy's exact location. They carry a holo-targeter to mark targets."
+LeftAbilityTreeTitle="Scout"
+RightAbilityTreeTitle="Spotter"
; Nicknames
RandomNickNames[0]="Angel"
RandomNickNames[1]="Scope"
RandomNickNames[2]="Beta"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Bones"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Solo"
RandomNickNames[10]="Dr. Feelgood"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Firewall"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Gizmo"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Jolt"
RandomNickNames[18]="Eyes"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Binoc"
RandomNickNames[21]="Newton"
RandomNickNames[22]="Ragtime"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Skipper"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Cyclops"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Zulu"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"

[LWD_Sapper X2SoldierClassTemplate]
+DisplayName="Sapper"
+ClassSummary="The Sapper specializes in using their grenade launcher to control the battlefield - usually by destroying it. "
+LeftAbilityTreeTitle="Explosives"
+RightAbilityTreeTitle="Demolitions"
; Nicknames
RandomNickNames[0]="Angel"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Beta"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Bones"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Boomtown"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Dr. Feelgood"
RandomNickNames[11]="Downtown"
RandomNickNames[12]="Demoman"
RandomNickNames[13]="Bulldozer"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Gizmo"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Jolt"
RandomNickNames[18]="Hard Hat"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Mega"
RandomNickNames[21]="Newton"
RandomNickNames[22]="Ragtime"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Skipper"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Zulu"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"

[LWD_Scrapper X2SoldierClassTemplate]
+DisplayName="Scrapper"
+ClassSummary="The Scrapper wishes they didn't have to carry a gun in the first place. They like to solve things with their fists, and, if the situation is really dire, knives."
+LeftAbilityTreeTitle="Thug"
+RightAbilityTreeTitle="Brawler"
; Nicknames
RandomNickNames[0]="Facetime"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Beta"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Bones"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Dr. Feelgood"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Cuddles"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Gizmo"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Jolt"
RandomNickNames[18]="Lightning"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Mega"
RandomNickNames[21]="Judo"
RandomNickNames[22]="Ragtime"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Hug-n-snug"
RandomNickNames[26]="Skipper"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Knife"
; Male Nicknames
RandomNickNames_Male[0]="Mr. Tibbs"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"

[LWD_Sharpshooter X2SoldierClassTemplate]
+DisplayName="Sharpshooter"
+ClassSummary="Our Sharpshooters engage enemy targets with pinpoint accuracy from extreme range. They carry a holotargeter to mark enemies for execution."
+LeftAbilityTreeTitle="Sniper"
+RightAbilityTreeTitle="Deadeye"
; Nicknames
RandomNickNames[0]="Angel"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Beta"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Bones"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Last Rites"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Dr. Feelgood"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Firewall"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Gizmo"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Jolt"
RandomNickNames[18]="Lightning"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Mega"
RandomNickNames[21]="Newton"
RandomNickNames[22]="Ragtime"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Skipper"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Pick'em"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Mr. Clean"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Huntress"
RandomNickNames_Female[4]="Queen"

[LWD_Shinobi X2SoldierClassTemplate]
+DisplayName="Shinobi"
+ClassSummary="The Shinobi serves as a capable scouting unit, using a sword to deliver stealthy close-range attacks."
+LeftAbilityTreeTitle="Saboteur"
+RightAbilityTreeTitle="Kenshi"
; Nicknames
RandomNickNames[0]="Angel"
RandomNickNames[1]="Bargain"
RandomNickNames[2]="Nightlight"
RandomNickNames[3]="Bishop"
RandomNickNames[4]="Cloak"
RandomNickNames[5]="Breaker"
RandomNickNames[6]="Broker"
RandomNickNames[7]="Conquest"
RandomNickNames[8]="Deacon"
RandomNickNames[9]="Doomtrain"
RandomNickNames[10]="Nighttime"
RandomNickNames[11]="Famine"
RandomNickNames[12]="Feedback"
RandomNickNames[13]="Fencer"
RandomNickNames[14]="Genius"
RandomNickNames[15]="Gizmo"
RandomNickNames[16]="Jester"
RandomNickNames[17]="Jolt"
RandomNickNames[18]="Lightning"
RandomNickNames[19]="Mayday"
RandomNickNames[20]="Sensei"
RandomNickNames[21]="Judo"
RandomNickNames[22]="Kung Fu"
RandomNickNames[23]="Rascal"
RandomNickNames[24]="Rattler"
RandomNickNames[25]="Revelation"
RandomNickNames[26]="Skipper"
RandomNickNames[27]="Thunder"
RandomNickNames[28]="Undertaker"
RandomNickNames[29]="War"
RandomNickNames[30]="Whoopsie"
RandomNickNames[31]="Slip"
; Male Nicknames
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
; Female Nicknames
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[3]="Duchess"
RandomNickNames_Female[4]="Queen"